AccumulationRegisters/упРасчетыСЗаказчиками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>упРасчетыСЗаказчиками</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КОплатеДоНачалаВыполненияРейса</Name>
					<Comment>Сумма</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КОплатеДоНачалаРаботыСЗаявкой</Name>
					<Comment>Сумма</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>АналитическийРазрезПоПартнерам</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упАналитическиеРазрезыПоПартнерам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчетов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упЗаявкаНаПеревозкуГруза</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяДоходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтатьиДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/упСтатусыЗаявкиНаПеревозкуГруза.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упСтатусыЗаявкиНаПеревозкуГруза</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеЗагружена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Новая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодобранаЦепьПоставок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеСогласована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КВыполнению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СформированыЗадания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВключенаВРейс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполненаЧастично</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПути</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/упРейс.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>упРейс</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УдалитьупОстаткиДокументовПоРейсу</xr:Item>
				<xr:Item>InformationRegister.упПрерыванияГрузовыхПотоков</xr:Item>
				<xr:Item>AccumulationRegister.упНепереданныеДокументы</xr:Item>
				<xr:Item>InformationRegister.упРасписаниеРаботыТС</xr:Item>
				<xr:Item>InformationRegister.упПланПоЗаданиям</xr:Item>
				<xr:Item>InformationRegister.упМаршрутПоРейсу</xr:Item>
				<xr:Item>AccumulationRegister.упВыработкаСотрудников</xr:Item>
				<xr:Item>InformationRegister.упСостоянияТранспортныхСредств</xr:Item>
				<xr:Item>InformationRegister.упОтветыНаЗапросыМобильныйКлиент</xr:Item>
				<xr:Item>InformationRegister.упПеревозчикПоРейсу</xr:Item>
				<xr:Item>InformationRegister.упЗанятостьТранспорта</xr:Item>
				<xr:Item>InformationRegister.упРасписаниеРаботыЭкипажей</xr:Item>
				<xr:Item>InformationRegister.упСтатусыЗаявокНаПеревозкуГруза</xr:Item>
				<xr:Item>InformationRegister.упСтатусыЗаданийНаПеревозкуГруза</xr:Item>
				<xr:Item>AccumulationRegister.упЗаданияКПланированию</xr:Item>
				<xr:Item>InformationRegister.упФактическиеМестоположенияТС</xr:Item>
				<xr:Item>InformationRegister.упСтатусыРейсов</xr:Item>
				<xr:Item>InformationRegister.упЗанятостьСотрудников</xr:Item>
				<xr:Item>InformationRegister.упДополнительныеСотрудникиРейса</xr:Item>
				<xr:Item>AccumulationRegister.упРасходыНаТС</xr:Item>
				<xr:Item>InformationRegister.упРаботыПоРейсу</xr:Item>
				<xr:Item>AccumulationRegister.упРасходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упВидыПеревозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТранспортнойУслуги</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упВидыТранспортныхУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникСозданияОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упИсточникиСозданияОбъекта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальныйКоэффициентЗагрузки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упНаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничениеМаршрутизатора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упОграниченияМаршрутизаторов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеревозкаТранспортнойКомпанией</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокИсполненияЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упПорядокИсполненияЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расписание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упРасписанияПериодическихРейсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СреднийКоэффициентЗагрузки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСтатусWMS</Name>
					<Comment>Статусы WMS хранятся в отдельном регистре</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРасходы</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРасходыНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Трекер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упМобильныеУстройстваИТрекеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧасовойПояс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упЧасовыеПояса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладскиеВорота</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСкладскиеВорота</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОптимизацияМаршрута</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Задания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Задание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.упЗаданиеНаПеревозкуГруза</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГрузовоеМесто</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упГрузовыеМеста</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тара</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упГрузовыеМеста</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоГрузов</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоГрузов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПлановыеРасходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упСтатьиДоходовРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Задание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.упЗаданиеНаПеревозкуГруза</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПравилоРаспределения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упПравилаРаспределенияРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоОпераций</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упСтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/упАналитическиеРазрезыПоПартнерам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упАналитическиеРазрезыПоПартнерам</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСоглашенияСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/упРасчетыСЗаказчиками/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Функция проверяет есть ли задолженность по предоплате
//
// Параметры:
//	ДополнительныеСвойства - Структура - Свойства.
//	Ссылка - ДокументСсылка - Ссылка на элемент.
//	Движения - КоллекцияДвижений - Коллекция движений документа.
//	Реквизиты - Структура - Реквизиты.
//	Отказ - Булево - Применить изменения.
//
Процедура ПроконтролироватьРасчетыСЗаказчиками(ДополнительныеСвойства, Ссылка, Движения, Реквизиты, Отказ) Экспорт
	
	Если Отказ Тогда 
		Возврат; 
	КонецЕсли;
	
	// Если статус устанавливается по кнопке из документа или по событию
	Если ДополнительныеСвойства.ВестиУчетРасчетовСЗаказчиками
		И ДополнительныеСвойства.Статус = Перечисления.упСтатусыЗаявкиНаПеревозкуГруза.КВыполнению 
		И НЕ ДополнительныеСвойства.ТекущийСтатус = Перечисления.упСтатусыЗаявкиНаПеревозкуГруза.КВыполнению Тогда
		
		
		// Проконтролировать остаток предоплаты по заявке
		Если ДополнительныеСвойства.КонтролироватьПредоплату Тогда
			тбзЗадолженностьПоПредоплате = ЗадолженностьПоПредоплатеПоЗаявке(ДополнительныеСвойства.АналитическийРазрезПоПартнерам, Ссылка);
			мсвЗадолженность = Новый Массив;
			Для каждого Строка Из тбзЗадолженностьПоПредоплате Цикл
				мсвЗадолженность.Добавить(СтрШаблон("%1%2", Строка.Остаток, Строка.Валюта));
			КонецЦикла;
			СтрокаЗадолженность = СтрСоединить(мсвЗадолженность, "; ");
			
			Если мсвЗадолженность.Количество() > 0 Тогда
				ТекстСообщения = Нстр("ru = 'Нельзя переводить %1 в статус ""К выполнению"", так как предоплата внесена не полностью(Остаток:%2)'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Ссылка,СтрокаЗадолженность);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			КонецЕсли;
		КонецЕсли;
		
		// Проконтролировать максимальную задолженность по соглашению
		Если ЗначениеЗаполнено(Реквизиты.Соглашение) Тогда
			сткСоглашение = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Реквизиты.Соглашение, "КонтролироватьДебиторскуюЗадолженность, МаксимальнаяЗадолженность, ГруппаТарифов");
			ВалютаСоглашения			= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(сткСоглашение.ГруппаТарифов, "Валюта");
			МаксимальнаяЗадолженность	= сткСоглашение.МаксимальнаяЗадолженность;
			Если сткСоглашение.КонтролироватьДебиторскуюЗадолженность Тогда
				ЗадолженностьПоСоглашению	= ЗадолженностьПоСоглашению(ДополнительныеСвойства.АналитическийРазрезПоПартнерам, ВалютаСоглашения, Реквизиты.Дата, ДополнительныеСвойства.ВедетсяВалютныйУчет);	
				Если ЗадолженностьПоСоглашению > МаксимальнаяЗадолженность Тогда
					Если ДополнительныеСвойства.ВедетсяВалютныйУчет Тогда
						ВалютаПредставление = Нстр("ru = '; Валюта соглашения:%1'");
						ВалютаПредставление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ВалютаПредставление, ВалютаСоглашения);
					Иначе	
						ВалютаПредставление = "";
					КонецЕсли;
					ТекстСообщения = Нстр("ru = 'Нельзя переводить %1 в статус ""К выполнению"", так как задолженность по соглашению превышает допустимую.(Задолженность:%2; Максимальная задолженность:%3%4)'");
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Ссылка,ЗадолженностьПоСоглашению, МаксимальнаяЗадолженность, ВалютаПредставление);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Функция проверяет есть ли задолженность по предоплате
//
// Параметры:
//  Ссылка - ДокументСсылка	 - Ссылка на элемент.
//  Отказ	 - Булево			 - Применить изменения.
//
Процедура ПроконтролироватьОстатокПредоплатыПоРейсу(Ссылка, Отказ) Экспорт
	
	Если Отказ Тогда 
		Возврат; 
	КонецЕсли;
	
	// Если статус устанавливается по кнопке из документа или по событию
	тбзЗадолженностьПоПредоплате = ЗадолженностьПоПредоплатеПоРейсу(Ссылка);
	
	мсвЗадолженность = Новый Массив;
	Для каждого Строка Из тбзЗадолженностьПоПредоплате Цикл
		мсвЗадолженность.Добавить(НСтр(СтрШаблон("ru = 'Объект расчетов: %1, задолженность: %2, %3'", Строка.ОбъектРасчетов, Строка.КОплатеДоНачалаВыполненияРейсаОстаток, Строка.Валюта)));
	КонецЦикла;
	
	СтрокаЗадолженность = СтрСоединить(мсвЗадолженность, Символы.ПС);
			
	Если мсвЗадолженность.Количество() > 0 Тогда
		ТекстСообщения = НСтр("ru = 'Нельзя переводить %1 в статус ""К выполнению"", так как предоплата внесена не полностью: %2%3)'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, Ссылка, Символы.ПС, СтрокаЗадолженность);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
	КонецЕсли;

КонецПроцедуры

// Функция возвращает задолженность по аналитическому разрезу по заявке.
//
// Параметры:
//	АналитическийРазрезПоПартнерам 	- СправочникСсылка.упАналитическиеРазрезыПоПартнерам - аналитический разрез.
//	Заявка 							- ДокументСсылка.упЗаявкиНаПеревозкуГрузов - заявка.
//
// Возвращаемое значение:
//	ТаблицаЗначений
//			* Валюта 	- СправочникСсылка.Валюты 	- валюта задолженности.
//			* Остаток	- Число						- задолженность.
//
Функция ЗадолженностьПоПредоплатеПоЗаявке(АналитическийРазрезПоПартнерам, Заявка)
	
	тбзРезультат = Неопределено;	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	упРасчетыСЗаказчикамиОстатки.КОплатеДоНачалаРаботыСЗаявкойОстаток КАК Остаток,
	               |	упРасчетыСЗаказчикамиОстатки.Валюта
	               |ИЗ
	               |	РегистрНакопления.упРасчетыСЗаказчиками.Остатки(
	               |			,
	               |			АналитическийРазрезПоПартнерам = &АналитическийРазрезПоПартнерам
	               |				И ОбъектРасчетов = &ОбъектРасчетов) КАК упРасчетыСЗаказчикамиОстатки";
	Запрос.УстановитьПараметр("АналитическийРазрезПоПартнерам", АналитическийРазрезПоПартнерам);
	Запрос.УстановитьПараметр("ОбъектРасчетов", 				Заявка);
	тбзРезультат = Запрос.Выполнить().Выгрузить();

	Возврат тбзРезультат;

КонецФункции	

// Функция возвращает задолженность по аналитическому разрезу по заявке.
//
// Параметры:
//  АналитическийРазрезПоПартнерам	 - СправочникСсылка.упАналитическиеРазрезыПоПартнерам	 - аналитический разрез.
//  ВалютаСоглашения				 - СправочникСсылка.Валюты								 - валюта.
//  Дата					 		 - Дата													 - дата, для пересчета из упр. валюты в валюту соглашения.
// 
// Возвращаемое значение:
//  Число - задолженность.
//
Функция ЗадолженностьПоСоглашению(АналитическийРазрезПоПартнерам, ВалютаСоглашения, Дата, ВедетсяВалютныйУчет)
	
	Результат = 0;	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	упРасчетыСЗаказчикамиОстатки.СуммаОстаток,
	|	упРасчетыСЗаказчикамиОстатки.Валюта
	|ИЗ
	|	РегистрНакопления.упРасчетыСЗаказчиками.Остатки(, АналитическийРазрезПоПартнерам = &АналитическийРазрезПоПартнерам) КАК упРасчетыСЗаказчикамиОстатки";
	Запрос.УстановитьПараметр("АналитическийРазрезПоПартнерам", АналитическийРазрезПоПартнерам);
	
	Выборка	= Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СуммаОстаток = Выборка.СуммаОстаток;
		Если ВедетсяВалютныйУчет И Не Выборка.Валюта = ВалютаСоглашения Тогда
			КурсВалютыСоглашения   	= РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаСоглашения, Дата);
			КурсВалютыОстатка	 	= РаботаСКурсамиВалют.ПолучитьКурсВалюты(Выборка.Валюта, Дата);			
			СуммаОстаток	= РаботаСКурсамиВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(СуммаОстаток,  Выборка.Валюта, ВалютаСоглашения, КурсВалютыОстатка.Курс, КурсВалютыСоглашения.Курс, КурсВалютыОстатка.Кратность, КурсВалютыСоглашения.Кратность);					
		КонецЕсли;
		Результат = Результат + СуммаОстаток;	
	КонецЦикла;
	
	Возврат Результат;

КонецФункции	


// Функция возвращает задолженность по заявкам.
//
// Параметры:
//	Рейс - ДокументСсылка.упРейс - рейс.
//
// Возвращаемое значение:
//	ТаблицаЗначений
//			* Валюта - СправочникСсылка.Валюты - валюта задолженности.
//			* КОплатеДоНачалаВыполненияРейсаОстаток - Число - задолженность.
//
Функция ЗадолженностьПоПредоплатеПоРейсу(Рейс) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	упЗаявкаНаПеревозкуГруза.Ссылка КАК ЗаявкаНаПеревозкуГруза,
	|	упАналитическиеРазрезыПоПартнерам.Ссылка КАК АналитическийРазрезПоПартнерам
	|ПОМЕСТИТЬ втАналитическиеРазрезыПоРейсу
	|ИЗ
	|	Документ.упРейс.Задания КАК упРейсЗадания
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упЗаданиеНаПеревозкуГруза КАК упЗаданиеНаПеревозкуГруза
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упЗаявкаНаПеревозкуГруза КАК упЗаявкаНаПеревозкуГруза
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.упАналитическиеРазрезыПоПартнерам КАК упАналитическиеРазрезыПоПартнерам
	|				ПО упЗаявкаНаПеревозкуГруза.Заказчик = упАналитическиеРазрезыПоПартнерам.Партнер
	|					И упЗаявкаНаПеревозкуГруза.КонтрагентЗаказчика = упАналитическиеРазрезыПоПартнерам.Контрагент
	|					И упЗаявкаНаПеревозкуГруза.Организация = упАналитическиеРазрезыПоПартнерам.Организация
	|			ПО упЗаданиеНаПеревозкуГруза.ЗаявкаНаПеревозкуГруза = упЗаявкаНаПеревозкуГруза.Ссылка
	|		ПО упРейсЗадания.Задание = упЗаданиеНаПеревозкуГруза.Ссылка
	|ГДЕ
	|	упРейсЗадания.Ссылка = &Рейс
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	упРасчетыСЗаказчикамиОстатки.ОбъектРасчетов,
	|	упРасчетыСЗаказчикамиОстатки.КОплатеДоНачалаВыполненияРейсаОстаток КАК КОплатеДоНачалаВыполненияРейсаОстаток,
	|	упРасчетыСЗаказчикамиОстатки.Валюта
	|ИЗ
	|	РегистрНакопления.упРасчетыСЗаказчиками.Остатки(
	|			,
	|			(АналитическийРазрезПоПартнерам, ОбъектРасчетов) В
	|				(ВЫБРАТЬ
	|					втАналитическиеРазрезыПоРейсу.АналитическийРазрезПоПартнерам,
	|					втАналитическиеРазрезыПоРейсу.ЗаявкаНаПеревозкуГруза
	|				ИЗ
	|					втАналитическиеРазрезыПоРейсу КАК втАналитическиеРазрезыПоРейсу)) КАК упРасчетыСЗаказчикамиОстатки";
	Запрос.УстановитьПараметр("Рейс", Рейс);
	тбзРезультат = Запрос.Выполнить().Выгрузить();
	
	Возврат тбзРезультат;
	
КонецФункции	

#Область ФормированиеДвижений

// Процедура формирует записи по регистру "Расчеты с заказчиками" для документа фактические доходы.
//
// Параметры:
//	ДополнительныеСвойства - Структура - Свойства.
//	Ссылка - ДокументСсылка - Ссылка на элемент.
//	Движения - КоллекцияДвижений - Коллекция движений документа.
//	Реквизиты - Структура - Реквизиты.
//	Отказ - Булево - Применить изменения.
//
Процедура СформироватьДвиженияРасчетыСЗаказчиками(ДополнительныеСвойства, Ссылка, Движения, Реквизиты, Отказ) Экспорт

	Если Отказ Или НЕ ДополнительныеСвойства.ВестиУчетРасчетовСЗаказчиками Или Реквизиты.Аннулирован Тогда 
		Возврат; 
	КонецЕсли;
	
	ДвиженияРасчетыСЗаказчиками	= Движения.упРасчетыСЗаказчиками;
	ДвиженияРасчетыСЗаказчиками.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасшифровкаПлатежа.АналитическийРазрезПоПартнерам,
	|	РасшифровкаПлатежа.ОбъектРасчетов,
	|	РасшифровкаПлатежа.Валюта,
	|	РасшифровкаПлатежа.Сумма,
	|	РасшифровкаПлатежа.СтатьяДоходов,
	|	РасшифровкаПлатежа.СуммаВалюта
	|ПОМЕСТИТЬ втРасшифровкаПлатежа
	|ИЗ
	|	&тбзРасшифровкаПлатежа КАК РасшифровкаПлатежа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втРасшифровкаПлатежа.АналитическийРазрезПоПартнерам,
	|	втРасшифровкаПлатежа.ОбъектРасчетов,
	|	втРасшифровкаПлатежа.Валюта,
	|	втРасшифровкаПлатежа.СтатьяДоходов,
	|	СУММА(втРасшифровкаПлатежа.Сумма) КАК Сумма,
	|	СУММА(втРасшифровкаПлатежа.СуммаВалюта) КАК СуммаВалюта
	|ПОМЕСТИТЬ втРасшифровка
	|ИЗ
	|	втРасшифровкаПлатежа КАК втРасшифровкаПлатежа
	|
	|СГРУППИРОВАТЬ ПО
	|	втРасшифровкаПлатежа.СтатьяДоходов,
	|	втРасшифровкаПлатежа.ОбъектРасчетов,
	|	втРасшифровкаПлатежа.Валюта,
	|	втРасшифровкаПлатежа.АналитическийРазрезПоПартнерам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втРасшифровка.АналитическийРазрезПоПартнерам,
	|	втРасшифровка.ОбъектРасчетов,
	|	втРасшифровка.СтатьяДоходов,
	|	втРасшифровка.Валюта,
	|	втРасшифровка.Сумма,
	|	втРасшифровка.СуммаВалюта,
	|	ЕСТЬNULL(упРасчетыСЗаказчикамиОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
	|	ЕСТЬNULL(упРасчетыСЗаказчикамиОстатки.КОплатеДоНачалаРаботыСЗаявкойОстаток, 0) КАК КОплатеДоНачалаРаботыСЗаявкойОстаток,
	|	ЕСТЬNULL(упРасчетыСЗаказчикамиОстатки.КОплатеДоНачалаВыполненияРейсаОстаток, 0) КАК КОплатеДоНачалаВыполненияРейсаОстаток
	|ИЗ
	|	РегистрНакопления.упРасчетыСЗаказчиками.Остатки(
	|			,
	|			(АналитическийРазрезПоПартнерам, ОбъектРасчетов, СтатьяДоходов, Валюта) В
	|				(ВЫБРАТЬ
	|					втРасшифровкаПлатежа.АналитическийРазрезПоПартнерам,
	|					втРасшифровкаПлатежа.ОбъектРасчетов,
	|					втРасшифровкаПлатежа.СтатьяДоходов,
	|					втРасшифровкаПлатежа.Валюта
	|				ИЗ
	|					втРасшифровкаПлатежа КАК втРасшифровкаПлатежа)) КАК упРасчетыСЗаказчикамиОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ втРасшифровка КАК втРасшифровка
	|		ПО упРасчетыСЗаказчикамиОстатки.АналитическийРазрезПоПартнерам = втРасшифровка.АналитическийРазрезПоПартнерам
	|			И упРасчетыСЗаказчикамиОстатки.ОбъектРасчетов = втРасшифровка.ОбъектРасчетов
	|			И упРасчетыСЗаказчикамиОстатки.СтатьяДоходов = втРасшифровка.СтатьяДоходов
	|			И упРасчетыСЗаказчикамиОстатки.Валюта = втРасшифровка.Валюта";
	
	Если ТипЗнч(Реквизиты.РасшифровкаПлатежа) = Тип("ТаблицаЗначений")
			И НЕ ДополнительныеСвойства.ВедетсяВалютныйУчет 
			И Реквизиты.РасшифровкаПлатежа.Колонки.Найти("СуммаВалюта") = Неопределено Тогда
		Реквизиты.РасшифровкаПлатежа.Колонки.Добавить("СуммаВалюта", Новый ОписаниеТипов("Число",
																	 Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Любой)));
	КонецЕсли;
	
	Запрос.УстановитьПараметр("тбзРасшифровкаПлатежа", Реквизиты.РасшифровкаПлатежа);
	Выборка	= Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДвижениеРасчетыСЗаказчиками = ДвиженияРасчетыСЗаказчиками.Добавить();
		ЗаполнитьЗначенияСвойств(ДвижениеРасчетыСЗаказчиками, Выборка);
		ДвижениеРасчетыСЗаказчиками.ВидДвижения				= ВидДвиженияНакопления.Расход;
		ДвижениеРасчетыСЗаказчиками.Период               	= Реквизиты.Дата;
		ДвижениеРасчетыСЗаказчиками.Регистратор          	= Ссылка;
		
		Если ДополнительныеСвойства.ВедетсяВалютныйУчет Тогда
			СуммаОстаток	= Выборка.СуммаВалюта;
		Иначе
			СуммаОстаток	= Выборка.Сумма;
		КонецЕсли;
		ДвижениеРасчетыСЗаказчиками.Сумма = СуммаОстаток;
		
		//Если СуммаОстаток > Выборка.СуммаОстаток Тогда
		//	ТекстСообщения = Нстр("ru = 'Сумма оплаты %1 (Аналитический разрез:%2;Объект расчета:%3;Статья доходов:%4;Валюта:%5) больше чем указано в фактических доходах:%6.'");
		//	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Выборка.Сумма, Выборка.АналитическийРазрезПоПартнерам, Выборка.ОбъектРасчетов, Выборка.СтатьяДоходов, Выборка.Валюта, Выборка.СуммаОстаток);
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		//	Событие = Нстр("ru = 'Ошибка при проведении счета на оплату заказчику'");
		//	ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Предупреждение,,Ссылка, ТекстСообщения);    
		//КонецЕсли;
		
		СуммаПоЗаявке 	= 0;
		Если Выборка.КОплатеДоНачалаРаботыСЗаявкойОстаток > СуммаОстаток Тогда
			СуммаПоЗаявке = СуммаОстаток;
		Иначе	
			СуммаПоЗаявке = Выборка.КОплатеДоНачалаРаботыСЗаявкойОстаток;
		КонецЕсли;
		ДвижениеРасчетыСЗаказчиками.КОплатеДоНачалаРаботыСЗаявкой = СуммаПоЗаявке;
		СуммаОстаток = СуммаОстаток - СуммаПоЗаявке;
		
		СуммаПоРейсу = 0;
		Если Выборка.КОплатеДоНачалаВыполненияРейсаОстаток > СуммаОстаток Тогда
			СуммаПоРейсу = СуммаОстаток;
		Иначе	
			СуммаПоРейсу = Выборка.КОплатеДоНачалаВыполненияРейсаОстаток;
		КонецЕсли;
		ДвижениеРасчетыСЗаказчиками.КОплатеДоНачалаВыполненияРейса = СуммаПоРейсу;
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
